import exrex


QUESTIONS = [
    ("(измен\\w*|друг\\w*|в связи с изменен\\w*) (фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    ("(измен\\w*|друг\\w*|в связи с изменен\\w*) (фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) ?(как|ка1к можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "0.0"),
    ("(фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) (измен\\w*|друг\\w*|в связи с изменен\\w*) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    ("(фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) (измен\\w*|друг\\w*|в связи с изменен\\w*) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "0.0"),
    ("(как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте) (измен\\w*|друг\\w*|в связи с изменен\\w*) (фамили\\w*|им\\w*|отчеств\\w*|данн\\w*)", "0.0"),
]

def generate_all_expressions(regex, reversed_list: bool = True):
    try:
        if reversed_list:
            return list(reversed(list(exrex.generate(regex))))
        else:
            return list(exrex.generate(regex))
    except Exception as error:
        print(f"Ошибка при генерации для regex: {regex}")
        print(f"Сообщение об ошибке: {error}")
        return []


counter = 0

for i, (regex, _) in enumerate(QUESTIONS, 1):
    print(f"\nРегулярное выражение {i}: {regex}")
    possible_expression = generate_all_expressions(regex)
    print(f"Все возможные значения ({len(possible_expression)}):")

    for expression in possible_expression:
        print(expression)
        counter += 1

print("ВСЕГО:", counter)
