import re

QUESTIONS = [
    ("(измен\\w*|друг\\w*|в связи с изменен\\w*) (фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    ("(измен\\w*|друг\\w*|в связи с изменен\\w*) (фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) ?(как|ка1к можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "0.0"),
    ("(фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) (измен\\w*|друг\\w*|в связи с изменен\\w*) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    ("(фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) (измен\\w*|друг\\w*|в связи с изменен\\w*) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "0.0"),
    ("(как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте) (измен\\w*|друг\\w*|в связи с изменен\\w*) (фамили\\w*|им\\w*|отчеств\\w*|данн\\w*)", "0.0"),
]

test_phrases = [
    # "изменил имя паспорт",
    # "фамилию изменил в паспорте",
    # "как заменить паспорт изменилось отчество",
    # "изменилась фамилия паспорт",
    "изменились данные паспорт новый",
]

for q in QUESTIONS:
    for test_phrase in test_phrases:
        if re.search(q[0], test_phrase, flags=re.U):
            print(f"Regular Expression: {q}\n"
                  f"Test Phrase: {test_phrase}\n"
                  f"Result: OK\n\n")
        print(f"Regular Expression: {q}\n"
              f"Test Phrase: {test_phrase}\n"
              f"Result: NOT FOUND !!!\n\n")
