# -*-coding=utf-8-*-


from utilities.regexp_check_with_query import check_regexp_with_queries

COMMON_REGEXP = r"(как|что|какое|какой)? ?(можно|нужно|мне|необ\w*|обяз\w*)? ?(\w*делать|нужно|порядок)? ?(для|чтобы)? ?(оформ\w*|\w*делать|получ\w*|заказ\w*|\w*готов\w*)"
QUESTIONS = [
    (COMMON_REGEXP + r"? ?(апост\w*|апаст\w*)", "201"),
    (COMMON_REGEXP + r"? ?(справк\w* (о|для)? ?назнач\w* пенс\w*)", "202"),
    (COMMON_REGEXP + r" (пенс\w*)", "203"),
    (COMMON_REGEXP + r"? ?(удостов\w* многод\w* сем\w*)", "204"),
    (COMMON_REGEXP + r"? ?((един\w*)? ?выпл\w* (к|для)? ?школ\w* многод\w* сем\w*)", "205"),
    (COMMON_REGEXP + r"? ?((ежем\w*)? ?выпл\w* (для)? ?многод\w* сем\w* (на|для) проезд\w*)", "206"),
    (COMMON_REGEXP + r"? ?(ежем\w*)? ?(выпл\w*|компен\w*) (для)? ?многод\w* сем\w* ?(на|для|за)? (комун\w*|коммун\w*) услуг\w*", "207"),
    (COMMON_REGEXP + r"? ?(выпл\w*|компен\w*)? ?(за)? расход\w* (для|на|за)? проезд\w* (к|до) мест\w* отдыха ?(и обратно)? ?(для)? многод\w* сем\w*", "208"),
    (COMMON_REGEXP + r"? ?(выпл\w*|компен\w*)? ?(для|на)? (оплат\w*|расход\w*) газиф\w* ?(для)? многод\w* сем\w*", "209"),
    (COMMON_REGEXP + r"? ?(тср|тэ сэ эр|тэ се эр|те се эр)|(техн\w*)? ?сред\w* (реаб\w*|абилит\w*) ?(для)? ?(инвал\w*)?", "210"),

]

# Все регулярные дополнительные проверены
test_phrases = [
    "апостиль",  # 201
    "справка о назначении пенсии", "справку о назначении пенсии",  # 202
    "оформить пенсию", "оформление пенсии",  # 203
    "удостоверение многодетной семьи", "удостоверение многодетных семей",  # 204
    "выплату к школе многодетным семьям", "выплат к школе многодетных семей",  # 205
    "ежемесячная выплата многодетным семьям для проезда", "выплата многодетных семей на проезд",  # 206
    "компенсацию многодетным семьям на коммунальные услуги", "компенсация многодетной семье коммунальных услуг",  # 207
    "компенсацию расходов на проезд к месту отдыха и обратно многодетным семьям", "компенсация расходов на проезд к месту отдыха многодетной семьи",  # 208
    "компенсацию на оплату газификации для многодетной семьи", "компенсировать оплату газификации многодетных семей",  # 209
    "оформить тср технические средства реабилитации", "оформить тэ сэ эр средства реабилитации", "оформить средства реабилитации", "оформить средства реабилитации инвалида",  # 210

]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
