# -*-coding=utf-8-*-


from utilities.regexp_check_with_query import check_regexp_with_queries

COMMON_REGEXP = r"(как|что|какое|какой)? ?(можно|нужно|мне|необ\w*|обяз\w*)? ?(\w*делать|нужно|порядок)? ?(для|чтобы)? ?(оформ\w*|\w*делать|получ\w*|заказ\w*|\w*готов\w*)"

QUESTIONS = [
    (r"(как? ?(можно|нужно|мне)?|какое|что (\w*делать|нужно)? ?(для|чтобы)?)? ?(оформ\w*|\w*делать||получ\w*|заказ\w*|\w*готов\w*)? ?((ежем\w*)? ?выпл\w* (для)? ?многод\w* сем\w* (на|для) проезд\w*)", "206"),
    (COMMON_REGEXP + r"? ?((един\w*)? ?выпл\w* (к|для)? ?школ\w* многод\w* сем\w*)$", "205"),
    (COMMON_REGEXP + r"? ?((ежем\w*)? ?выпл\w* (для)? ?многод\w* сем\w* (на|для) проезд\w*)", "206"),

]


test_phrases = [
    # "как оформить ежемесячную выплату многодетным семьям на проезд",
    # "оформить ежемесячную выплату многодетным семьям на проезд",
    # "ежемесячная выплата многодетным семьям на проезд",
    # "ежемесячная выплата многодетным семьям для проезда",
    "выплата для многодетных семей на проезд",

]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
