# -*-coding=utf-8-*-


from utilities.regexp_check_with_query import check_regexp_with_queries

COMMON_REGEXP = r"(как|что|какое|какой)? ?(можно|нужно|мне|необ\w*|обяз\w*)? ?(\w*делать|нужно|порядок)? ?(для|чтобы)? ?(оформ\w*|\w*делать|получ\w*|заказ\w*|\w*готов\w*)"

QUESTIONS = [
    # (r"(как? ?(можно|нужно|мне)?|какое|что (\w*делать|нужно)? ?(для|чтобы)?)? ?(оформ\w*|\w*делать||получ\w*|заказ\w*|\w*готов\w*)? ?((един\w*)? ?выпл\w* (к|для) школ\w* многод\w* семь\w*)", "205"),
    (COMMON_REGEXP + r"? ?(един\w*)? ?выпл\w* ?(к|для)? школ\w* многод\w* сем\w*", "205"),
]


test_phrases = [
    # "как оформить единовременную выплату к школе многодетным семьям",
    # "оформить единовременную выплату к школе многодетным семьям",
    "единовременная выплата для школьников многодетных семей",
    "единовременную выплату к школе многодетным семьям",
    "выплату к школе многодетным семьям",
    "выплату для школы многодетным семьям",

]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
