# -*-coding=utf-8-*-


from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r"(как? ?(можно|нужно|мне)?|какое|что (\w*делать|нужно)? ?(для|чтобы)?)? ?(оформ\w*|\w*делать||получ\w*|заказ\w*|\w*готов\w*)? ?(выпл\w*|компен\w*) ?(за)? расход\w* (для|на|за)? проезд\w* (к|до) мест\w* отдыха ?(и обратно)? ?(для)? многод\w* сем\w*", "207"),

]


test_phrases = [
    "как оформить компенсацию расходов на проезд к месту отдыха и обратно многодетным семьям",
    "оформить компенсацию расходов на проезд к месту отдыха и обратно многодетным семьям",
    "компенсация расходов на проезд к месту отдыха и обратно многодетным семьям",
    "компенсация расхода на проезд к месту отдыха и обратно многодетным семьям",
    "компенсация расхода на проезд к месту отдыха многодетным семьям",

]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
