# -*-coding=utf-8-*-


from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r"(как? ?(можно|нужно|мне)?|какое|что (\w*делать|нужно)? ?(для|чтобы)?)? ?(оформ\w*|\w*делать||получ\w*|заказ\w*|\w*готов\w*)? ?((ежем\w*)? ?(выпл\w*|компен\w*) (для)? ?многод\w* сем\w* (на|для|за) (комун\w*|коммун\w*) услуг\w*)", "207"),

]


test_phrases = [
    "как оформить ежемесячную компенсацию многодетным семьям на коммунальные услуги",
    "оформить ежемесячную компенсацию многодетным семьям на коммунальные услуги",
    "ежемесячная компенсация многодетным семьям на коммунальные услуги",
    "компенсация многодетным семьям на коммунальные услуги",
    "компенсация многодетным семьям за коммунальные услуги",

]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
