from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    # (r'\bда\b|^правильн|(\bтак\s*)?точно|замечательно|именно\s*так|^так|^угадал.*|^(вс[её]\s+)?верн.*|подтверждаю|\b(ага|угу|йес|ес)\b|^устраивает|(?<!не)\s?приду', "ДА"),
    # (r'\bнет\b|не\s*верн|ошибка|по[-\s]*другому|иная|иное|иные|иной|иначе|не\s*так|не\s*правильн|ни\s*хрена|ни\s*хуя|лажа|не\s*угадал|не\s*устраивает|\bотказ|не приду', "НЕТ"),
    # (r'(?<!\bне)\s?приду', "confirm"),
    # (r'(?<!\bне )(отказ\w*|прид\w*)', "cancel"),
    # (r'(?<!\bне )(отказ\w*|прид\w*|пойд\w*)', "cancel"),
    (r'(?<!\bне )приду', "confirm"),
    (r'(?<!\bне )отказ|\bне приду', "cancel"),

]


test_phrases = [
    # "нет нет не отказываюсь",
    # "я не отказываюсь я приду обязательно алло",
    # "нет я пойду пойду 5 мая я знаю что мне 5 мая это пойду",
    "нет нет не отказываюсь не отказываюсь я я пойду 5 мая к 11 часам я знаю уже",
    # "не отказываюсь",
    # "отказываюсь"
    # "не отказываюсь",
    # "отказ",
    # "отбой",
    # "ка бэ",
    # "кэ бэ",
    # "КБ",
    # "Оформление карты болельщика",
    # "Получить карту болельщика",
]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
