from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r'предоставление единовременной денежной выплаты|выплаты участникам сво|выплаты участникам специальной военной операции|выплата губернатора как участнику сво|выплата участнику сво|единовременная выплата участнику сво', '28'),
    (r'(один)? ?миллион за участника сво|(один)? ?миллион членам погибшего участника сво', '28'),
]


test_phrases = [
    "миллион за участника сво",
    "миллион членам погибшего участника сво",
    # "удостоверение вдовы вбд",
    # "удостоверение члена семьи ветерана боевых действий",
    # "усыновление третьего ребенка",
    # "Подъемное пособие",
    # "подъемные",
    # "компенсация за найм",
    # "единовременная выплата",
    # "выплата по трудоустройству",
    # "единовременная выплата по трудоустройству",
    # "единовременное подъемное пособие",
    # "компенсацию расходов по договору найма",
    # "единовременную денежную выплату",
    # "изменение наименования, адреса местонахождения юридического лица",
    # "назначение нового руководителя юридического лица",
    # "изменение видов экономической деятельности юридического лица"
]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
