from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r'выдача удостоверения|погибшего инвалида войны|умершего инвалида войны|участника вов|участника великой отечественной войны', '55'),
    (r'(выдача|получ\w*)? ?удостов\w* (участн\w* (великой отечественной войны|вов|вбд)|вдовы (инвалида)? ?(великой отечественной войны|вов|вбд))', '55'),
    (r'(выдача|получ\w*)? ?удостов\w* (участн\w*|член\w* сем\w* (ветер\w* боевых действий|вбд))', '55'),
]


test_phrases = [
    "удостоверение вдовы инвалида вов",
    "удостоверение члена семьи участника вов",
    "удостоверение вдовы вбд",
    "удостоверение члена семьи ветерана боевых действий",
]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
