from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r'ежемесячных выплат|ежемесячных денежных выплат|выплат отдельным категориям граждан|едв ветеранам|ежемесячная денежная выплата ветеранам|пособие 550 рублей', '22'),
    (r'технич\w* средств\w* реабилит\w*|тср|ветеранов протезами|протезно[- ]ортопедическими изделиями|выплата компенсаций за самостоятельно приобретенные|компенсация расходов на содержание|ветеринарное обслуживание|собак[- ]проводников', '23'),
    (r"регистрация юридических лиц|регистрация физических лиц|в качестве индивидуальных предпринимателей|крестьянских хозяйств|фермерских хозяйств", "24", (
        (r"открытие (ип|индив\w* предпр\w*)", "24.1"),
        (r"закрытие (ип|индив\w* предпр\w*)", "24.2"),
        (r"внесение изменений (ип|индив\w* предпр\w*)", "24.3"),
        (r"регистрация (юл|юрид\w* лиц\w*)", "24.4"),
        (r"ликвидация (юл|юрид\w* лиц\w*)", "24.5"),
        (r"увеличение уставного капитала (юл|юрид\w* лиц\w*)", "24.6"),
        (r"изменение состава учредителей (юл|юрид\w* лиц\w*)", "24.7"),
        (r"подача уведомления о реорганизации (юл|юрид\w* лиц\w*)", "24.8"),
        (r"(измен\w* наименов\w*|адрес\w* мест\w* нахожд\w*|сведений о филиалах и представительствах) (юл|юрид\w* лиц\w*)", "24.9"),
        (r"(назнач\w* нов\w* руковод\w*|измен\w* должн\w* руковод\w*|назнач\w* нов\w* руковод\w* или измен\w* должн\w* руковод\w*|) (юл|юрид\w* лиц\w*)", "24.10"),
        (r"\w*мен\w* \w*вид\w* эконом\w* деятельн\w* (юл|юрид\w* лиц\w*)", "24.11"),
    )),
]


test_phrases = [
    "открытие ип",
    "закрытие ип",
    "внесение изменений ип",
    "регистрация юридического лица",
    "ликвидация юридического лица",
    "увеличение уставного капитала юридического лица",
    "изменение состава учредителей юридического лица",
    "подача уведомления о реорганизации юридического лица",
    "изменение наименования, адреса местонахождения юридического лица",
    "назначение нового руководителя юридического лица",
    "изменение видов экономической деятельности юридического лица"
]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
