from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r'(едеве|едеве|едевэ|е де ве|е де вэ|едв|едэвэ|едэве|е дэ вэ|е дэ ве|ежемес\w* денеж\w* выпл\w*) на третьего ?(реб[её]н\w*)?', '46'),
    (r'рождение третьего ребенка|с рождением третьего|или последующих детей|(едеве|едеве|едевэ|е де ве|е де вэ|едв|едэвэ|едэве|е дэ вэ|е дэ ве|ежемес\w* денеж\w* выпл\w*) на третьего', '46'),
    (r'(выплат\w*)? ?(с)? ?(рожден\w*)? ?трет\w* реб[её]н\w*|усынов\w* трет\w* реб[её]н\w*|выпл\w* (на|для)? ?трет\w* реб[её]н\w*', '46'),
]


test_phrases = [
    "едв на третьего",
    "едв на третьего ребенка",
    "выплата на третьего ребенка",
    "выплата третьего ребенка",
    "усыновление третьего ребенка",
    # "Подъемное пособие",
    # "подъемные",
    # "компенсация за найм",
    # "единовременная выплата",
    # "выплата по трудоустройству",
    # "единовременная выплата по трудоустройству",
    # "единовременное подъемное пособие",
    # "компенсацию расходов по договору найма",
    # "единовременную денежную выплату",
    # "изменение наименования, адреса местонахождения юридического лица",
    # "назначение нового руководителя юридического лица",
    # "изменение видов экономической деятельности юридического лица"
]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
