from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r"регистрация юридических лиц|регистрация физических лиц|в качестве индивидуальных предпринимателей|крестьянских хозяйств|фермерских хозяйств", "24", (
        (r"открытие ?(ип|индив\w* предпр\w*)?", "24.1"),
        (r"закрытие ?(ип|индив\w* предпр\w*)?", "24.2"),
        (r"внесение изменений ?(ип|индив\w* предпр\w*)?", "24.3"),
        (r"регистрация ?(юл|юрид\w* лиц\w*)?", "24.4"),
        (r"ликвидация ?(юл|юрид\w* лиц\w*)?", "24.5"),
        (r"увеличение уставного капитала ?(юл|юрид\w* лиц\w*)?", "24.6"),
        (r"изменение состава учредителей ?(юл|юрид\w* лиц\w*)?", "24.7"),
        (r"подача уведомления о реорганизации ?(юл|юрид\w* лиц\w*)?", "24.8"),
        (r"(измен\w* наименов\w*|адрес\w* мест\w* нахожд\w*|сведений о филиалах и представительствах) ?(юл|юрид\w* лиц\w*)?", "24.9"),
        (r"(назнач\w* нов\w* руковод\w*|измен\w* должн\w* руковод\w*|назнач\w* нов\w* руковод\w* или измен\w* должн\w* руковод\w*|) ?(юл|юрид\w* лиц\w*)?", "24.10"),
        (r"\w*мен\w* \w*вид\w* эконом\w* деятельн\w* ?(юл|юрид\w* лиц\w*)?", "24.11"),
    )),
]


test_phrases = [
    "Государственная регистрация юридических лиц",
    "Государственная регистрация физических лиц в качестве индивидуальных предпринимателей",
    "Государственная регистрация крестьянских (фермерских) хозяйств",
    "Открытие ип",
    "Закрытие ИП",
    "Внесение изменений ИП",
    "Регистрация ЮЛ",
    "Ликвидация ЮЛ",
    "Увеличение уставного капитала ЮЛ",
    "Изменение состава учредителей ЮЛ",
    "Подача уведомления о реорганизации",
    "Изменение наименования",
    "Изменение адреса места нахождения ЮЛ"
    "Изменение сведений о филиалах и представительствах",
    "Назначение нового руководителя ЮЛ",
    "Изменение видов экономической деятельности",
    "Открытие предпринимательства",
    "Закрытие предпринимательства",
    "Регистрация юридического лица",
    "Ликвидация юридического лица",
    "Изменение состава учредителей"

]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
