from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r'технич\w* средств\w* реабилит\w*|компенсация тэ эс эр|компенсация тср|тср|тэ эс эр|ветеранов протезами|протезно[- ]ортопедическими изделиями|выплата компенсаций за самостоятельно приобретенные|компенсация расходов на содержание|ветеринарное обслуживание|собак[- ]проводников', '23'),
    (r'получить протез|получить протезно ортопедические изделия|компенсация за собаку проводника|компенсация за протез', '23'),

]

test_phrases = [
    "технические средства реабилитации",
    "тср",
    "тэ эс эр",
    "получить протез",
    "получить протезно ортопедические изделия",
    "компенсация за собаку проводника",
    "компенсация за протез",
    "компенсация тср",
    "компенсация тэ эс эр",

]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
