QUESTIONS_PASSPORT_14_YEARS = [
    (ur"пасп[оа]рт (получить|оформить|сделать)? ?(возраст 14( лет)?|в возрасте 14( лет)?|в 14( лет)?|по достижению 14( лет)?|14( лет)?)", "0.0"),
    (ur"(как|как можно|как мне)? ?пасп[оа]рт (получить|оформить|сделать)? ?(возраст 14( лет)?|в возрасте 14( лет)?|в 14( лет)?|по достижению 14( лет)?|14( лет)?)", "0.0"),
    (ur"(как|как можно|как мне)? ?(получить|оформить|сделать)? ?пасп[оа]рт (возраст 14( лет)?|в возрасте 14( лет)?|в 14( лет)?|по достижению 14( лет)?|14( лет)?)", "0.0"),
]

QUESTIONS_PASSPORT_20_YEARS = [
    (ur"пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 20( лет)?|в возрасте 20( лет)?|в 20( лет)?|по достижению 20( лет)?|20( лет)?)", "0.0"),
    (ur"(как|как можно|как мне)? ?пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 20( лет)?|в возрасте 20( лет)?|в 20( лет)?|по достижению 20( лет)?|20( лет)?)", "0.0"),
    (ur"(как|как можно|как мне)? ?(получить|оформить|сделать|поменять)? ?пасп[оа]рт (возраст 20( лет)?|в возрасте 20( лет)?|в 20( лет)?|по достижению 20( лет)?|20( лет)?)", "0.0"),
]

QUESTIONS_PASSPORT_45_YEARS = [
    (ur"пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 45( лет)?|в возрасте 45( лет)?|в 45( лет)?|по достижению 45( лет)?|45( лет)?)", "0.0"),
    (ur"(как|как можно|как мне)? ?пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 45( лет)?|в возрасте 45( лет)?|в 45( лет)?|по достижению 45( лет)?|45( лет)?)", "0.0"),
    (ur"(как|как можно|как мне)? ?(получить|оформить|сделать|поменять)? ?(новый)? ?пасп[оа]рт (возраст 45( лет)?|в возрасте 45( лет)?|в 45( лет)?|по достижению 45( лет)?|45( лет)?)", "0.0"),
]

QUESTIONS_PASSPORT_BAD = [
    (ur"(замочил|намочил|испортил|порвал) пасп[оа]рт ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?","0.0"),
    (ur"пасп[оа]рт (замочил|намочил|испортил|порвал) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (ur"(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(плохой|испорченный|ху[её]вый|порванный|намоченный) пасп[оа]рт", "0.0"),
    (ur"(плохой|испорченный|ху[её]вый|порванный|намоченный) пасп[оа]рт (как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
]

QUESTIONS_PASSPORT_LOST = [
    (ur"(потерял|утерял|проебал|уворовали|исчез|потерянный|утерянный) пасп[оа]рт ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?","0.0"),
    (ur"пасп[оа]рт (потерял|утерял|проебал|уворовали|исчез|потерянный|утерянный) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (ur"(как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(плохой|испорченный|хуевый|порванный|намоченный) пасп[оа]рт", "0.0"),
    (ur"(потерянный|утерянный|про[её]банный|исчезнувший) пасп[оа]рт (как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
]

QUESTIONS_PASSPORT_CHANGE_DATA = [
    (ur"(изменил|изменил(ась|ось|ись)|друг(ая|ое|ие)|в связи с изменением) (фамили[яюи]|им(я|ени)|отчеств[оа]) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (ur"(изменил|изменил(ась|ось|ись)|друг(ая|ое|ие)|в связи с изменением) (фамили[яюи]|им(я|ени)|отчеств[оа]) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "0.0"),
    (ur"(фамили[яюи]|им(я|ени)|отчеств[оа]) (изменил|изменил(ась|ось|ись)|друг(ая|ое|ие)|в связи с изменением) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (ur"(фамили[яюи]|им(я|ени)|отчеств[оа]) (изменил|изменил(ась|ось|ись)|друг(ая|ое|ие)|в связи с изменением) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "0.0"),
    (ur"(как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте) (изменил(|ась|ось|ись)|друг(я|ое|е)|в связи с изменением) (фамили[яюи]|им(я|ени)|отчеств[оа])", "0.0"),
]

QUESTIONS_PASSPORT_CHANGE_DATA = [
    (ur"(измен\\w*|друг\\w*|в связи с изменен\\w*) (фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (ur"(измен\\w*|друг\\w*|в связи с изменен\\w*) (фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) ?(как|ка1к можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "0.0"),
    (ur"(фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) (измен\\w*|друг\\w*|в связи с изменен\\w*) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (ur"(фамили\\w*|им\\w*|отчеств\\w*|данн\\w*) (измен\\w*|друг\\w*|в связи с изменен\\w*) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "0.0"),
    (ur"(как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте) (измен\\w*|друг\\w*|в связи с изменен\\w*) (фамили\\w*|им\\w*|отчеств\\w*|данн\\w*)", "0.0"),
]
