from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r"добровольному переселению|проживающих за рубежом|прибывшим в омскую область|соотечественники|подъемное пособие соотечественникам|компенсация по договору найма соотечественникам|единовременная выплата соотечественникам", "35", (
        (r"пособ\w*|подъем\w*|единовр\w* пособ\w*|единовр\w* подъемн\w* пособ\w*|пособ\w* соотеч\w*|единовр\w* пособ\w* соотеч\w*", "35.1"),
        (r"компен\w* за найм|компен\w* найма|компен\w* по договору найма|компен\w* договор\w* найма\w*|компен\w* за жилое помещение|компен\w* жил\w* помещ\w*|компен\w* ?(програм\w*|по програм\w*)? ?(добров\w*)? ?(перес\w*)?", "35.2"),
        (r"(единовр\w*)? ?(денежн\w*)? ?выплат\w* ?(по трудоустр\w?|трудоустр\w*)?", "35.3"),
    )),
]


test_phrases = [
    "пособие",
    "Подъемное пособие",
    "подъемные",
    "компенсация за найм",
    "единовременная выплата",
    "выплата по трудоустройству",
    "единовременная выплата по трудоустройству",
    "единовременное подъемное пособие",
    "компенсацию расходов по договору найма",
    "единовременную денежную выплату",
    # "изменение наименования, адреса местонахождения юридического лица",
    # "назначение нового руководителя юридического лица",
    # "изменение видов экономической деятельности юридического лица"
]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
