from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r"многодетн\w* сем\w*|(\w*регистр\w*|оформ\*|запис\w*) многодетн\w* сем\w*", "15"),
    # (r'многодетная семья|регистрация многодетной|многодетной семьи', '15'),
]

test_phrases = [
    "регистрация многодетной семьи",
    "многодетная семья",
    "многодетной семьи",
]

test_phrases_additional = [
    "многодетная семья",
    "многодетной семьи",
    "многодетные семьи",
    "многодетным семьям",
    "многодетными семьями",
    "многодетных семей",
    "регистрация многодетной семьи",
    "оформление многодетной семьи",
    "запись многодетной семьи",
    "регистрация многодетных семей",
    "оформление многодетных семей",
    "запись многодетных семей",
]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
