from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r"(загран)?паспорт старого образца|(загран)?паспорт на 5 лет", "30", (
        # (r'оформление паспортов|выдача паспортов|паспартов гражданина рф|за пределами территории рф|за пределами российской федерации|загран паспорт на 5 лет|загран паспорт старого образца', '30', (
        (r'совершеннолетн', '30.1'),
        (r'\bреб[её]но?к\w?', '30.2', (
            (r'заграничный паспорт необходим для граждан в возрасте от 14 до 18 лет или (недееспособному|ограниченно дееспособному)', '30.2.1'),
            (r'заграничный паспорт необходим для граждан в возрасте до 14 лет', '30.2.2'),
        )),
    )),

    (r"(загран)?паспорт нового образца|(загран)?паспорт на 10 лет", "47"),
    # (r'содержащих электронные носители информации|за пределами территории российской федерации|загран|паспорт нового образца|загран|паспорт на 10 лет', '47'),

    (r"(рф|росс\w*)? ?паспорт ?(рф|росс\w*)?|паспорт (получ\w*|оформ\w*|\w*делать|\w*мен\w*|выда\w*|нуж\w*|надо|заказ\w*)|(получ\w*|оформ\w*|\w*делать|\w*мен\w*|выда\w*|нуж\w*|надо|заказ\w*) пасп[оа]рт\w* ?(российский|российской федерации|рф|россии)?", "68", (
    # (r"(рф|росс\w*)? ?паспорт ?(рф|росс\w*)?|российской федерации|пасп[оа]рт\w* (получ\w*|оформ\w*|\w*делать|\w*мен\w*|выда\w*|нуж\w*|надо|заказ\w*)|(получ\w*|оформ\w*|\w*делать|\w*мен\w*|выда\w*|нуж\w*|надо|заказ\w*) пасп[оа]рт\w* ?(российский|российской федерации|рф|россии)?", "68", (
        (r"14( лет)?|(возраст|достижение|в возрасте|в|уже|по достижению|) 14( лет)?", "68.1"),
        (r"20( лет)?|(возраст|достижение|в возрасте|в|уже|по достижению|) 20( лет)?", "68.2"),
        (r"45( лет)?|(возраст|достижение|в возрасте|в|уже|по достижению|) 45( лет)?", "68.2"),
        (r"(смен\w*|измен\w*|друг\w*|в связи с изменен\w*) (фамил\w*|им\w*|отчеств\w*|данн\w*|паспортных данн\w*) ?(пасп[оа]рт\w*|в пасп[оа]рт\w*)?", "68.3"),
        (r"(пасп[оа]рт)? ?(\w*мочил|испор\w*|порв\w*|разорв\w*|порча) ?(пасп[оа]рт\w*)?", "68.4"),
        (r"(пасп[оа]рт)? ?(утра\w*|\w*терян\w*|проебал|\w*воровал\w*|исчез\w*|проп\w*) ?(пасп[оа]рт\w*)?", "68.5"),
    )),

]

QUESTIONS_PASSPORT_14_YEARS = [
    (r"(возраст|достижение|в возрасте|в|уже|по достижению|) 14( лет)?", "0.0"),
    (r"(как|как можно|как мне)? ?пасп[оа]рт (получить|оформить|сделать)? ?(возраст 14( лет)?|в возрасте 14( лет)?|в 14( лет)?|по достижению 14( лет)?|14( лет)?)", "0.0"),
    (r"(как|как можно|как мне)? ?(получить|оформить|сделать)? ?пасп[оа]рт (возраст 14( лет)?|в возрасте 14( лет)?|в 14( лет)?|по достижению 14( лет)?|14( лет)?)", "0.0"),
]

QUESTIONS_PASSPORT_20_YEARS = [
    (r"пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 20( лет)?|в возрасте 20( лет)?|в 20( лет)?|по достижению 20( лет)?|20( лет)?)", "0.0"),
    (r"(как|как можно|как мне)? ?пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 20( лет)?|в возрасте 20( лет)?|в 20( лет)?|по достижению 20( лет)?|20( лет)?)", "0.0"),
    (r"(как|как можно|как мне)? ?(получить|оформить|сделать|поменять)? ?пасп[оа]рт (возраст 20( лет)?|в возрасте 20( лет)?|в 20( лет)?|по достижению 20( лет)?|20( лет)?)", "0.0"),
]

QUESTIONS_PASSPORT_45_YEARS = [
    (r"пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 45( лет)?|в возрасте 45( лет)?|в 45( лет)?|по достижению 45( лет)?|45( лет)?)", "0.0"),
    (r"(как|как можно|как мне)? ?пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 45( лет)?|в возрасте 45( лет)?|в 45( лет)?|по достижению 45( лет)?|45( лет)?)", "0.0"),
    (r"(как|как можно|как мне)? ?(получить|оформить|сделать|поменять)? ?(новый)? ?пасп[оа]рт (возраст 45( лет)?|в возрасте 45( лет)?|в 45( лет)?|по достижению 45( лет)?|45( лет)?)", "0.0"),
]

QUESTIONS_PASSPORT_BAD = [
    (r"(\w*мочил|испор\w*|порв\w*|разорв\w*) пасп[оа]рт ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (r"пасп[оа]рт (\w*мочил|испор\w*|порв\w*|разорв\w*) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (r"(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(плохой|испорченный|ху[её]вый|\w*ванный|\w*моченный) пасп[оа]рт", "0.0"),
    (r"(плохой|испорченный|ху[её]вый|\w*ванный|\w*моченный) пасп[оа]рт (как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
]

QUESTIONS_PASSPORT_LOST = [
    (r"(потерял|утерял|проебал|уворовали|исчез|потерянный|утерянный) пасп[оа]рт ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (r"пасп[оа]рт (потерял|утерял|проебал|уворовали|исчез|потерянный|утерянный) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (r"(как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(плохой|испорченный|хуевый|порванный|намоченный) пасп[оа]рт", "0.0"),
    (r"(потерянный|утерянный|про[её]банный|исчезнувший) пасп[оа]рт (как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
]

QUESTIONS_PASSPORT_CHANGE_DATA = [
    (r"(смен\w*|измен\w*|друг\w*|в связи с изменен\w*) (фамили\w*|им\w*|отчеств\w*|данн\w*) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (r"(измен\w*|друг\w*|в связи с изменен\w*) (фамили\w*|им\w*|отчеств\w*|данн\w*) ?(как|ка1к можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "0.0"),
    (r"(фамили\w*|им\w*|отчеств\w*|данн\w*) (измен\w*|друг\w*|в связи с изменен\w*) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "0.0"),
    (r"(фамили\w*|им\w*|отчеств\w*|данн\w*) (измен\w*|друг\w*|в связи с изменен\w*) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "0.0"),
    (r"(как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте) (измен\w*|друг\w*|в связи с изменен\w*) (фамили\w*|им\w*|отчеств\w*|данн\w*)", "0.0"),
]

QUESTIONS.extend(QUESTIONS_PASSPORT_14_YEARS)
QUESTIONS.extend(QUESTIONS_PASSPORT_20_YEARS)
QUESTIONS.extend(QUESTIONS_PASSPORT_45_YEARS)
QUESTIONS.extend(QUESTIONS_PASSPORT_BAD)
QUESTIONS.extend(QUESTIONS_PASSPORT_LOST)
QUESTIONS.extend(QUESTIONS_PASSPORT_CHANGE_DATA)

test_phrases = [
    # "паспорт",
    # "Паспорт РФ",
    # "Паспорт России",
    # "Российский паспорт",

    "на совершеннолетнего",

    # "Загран паспорт на 5 лет",
    # "Загран паспорт старого образца",

    # "Загран паспорт на 10 лет",
    # "Загран паспорт нового образца",

]

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
