from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r"(как|нужно|необходимо|хочу|нада|надо)? ?(снят\w*|отмен\w*|уб\w*|устан\w*|узн\w*)? ?(состоян\w*|статус\w*)? ?(самозапр\w*|запрет\w*) на кредит\w*", "71"),
    (r"(как|нужно|необходимо|хочу|нада|надо)? ?(снят\w*|отмен\w*|уб\w*|устан\w*|узн\w*)? ?(состоян\w*|статус\w*)? ?(самозапр\w*|запрет\w*) на (сим-карт\w*|симкарт\w*|сим карт\w*)", "72"),
]


test_phrases = [
    "запрет на кредиты",
    "запрет на кредит",
    "Снятие запрета на кредит",
    "Снятие запрета на кредиты",
    "Узнать статус запрета на кредит",
    "Узнать статус запрета на кредиты",
    "Самозапрет на кредит",
    "Самозапрет на кредиты",
    "Снятие самозапрета на кредит",
    "Снятие самозапрета на кредиты",

    "запрет на сим-карты",
    "запрет на сим-карту",
    "Снятие запрета на сим-карту",
    "Снятие запрета на сим-карты",
    "Узнать статус запрета на сим-карту",
    "Узнать статус запрета на сим-карты",
    "Самозапрет на сим-карты",
    "Самозапрет на сим-карту",
    "Снятие самозапрета на сим-карту",
    "Снятие самозапрета на сим-карты",

    "запрет на сим карты",
    "запрет на сим карту",
    "Снятие запрета на сим карту",
    "Снятие запрета на сим карты",
    "Узнать статус запрета на сим карту",
    "Узнать статус запрета на сим карты",
    "Самозапрет на сим карты",
    "Самозапрет на сим карту",
    "Снятие самозапрета на сим карту",
    "Снятие самозапрета на сим карты",




    # "удостоверение вдовы вбд",
    # "удостоверение члена семьи ветерана боевых действий",
]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
