from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r'адреса? мфц|режимы? работы мфц|адреса? офис(ов|а) мфц|режимы? работы офис(ов|а)', '1', (
        (r'област', '1.2', (
            (r'азовск', '1.2.1'),
            (r'большереченск', '1.2.2'),
            (r'большеуковск', '1.2.3'),
            (r'горьковск', '1.2.4'),
            (r'знаменск', '1.2.5'),
            (r'исилькульск', '1.2.6'),
            (r'калачинск', '1.2.7'),
            (r'колосовск', '1.2.8'),
            (r'кормиловск', '1.2.9'),
            (r'крутинск', '1.2.10'),
            (r'любинск', '1.2.11'),
            (r'марьяновск', '1.2.12'),
            (r'москаленск', '1.2.13'),
            (r'муромцевск', '1.2.14'),
            (r'называевск', '1.2.15'),
            (r'нижнеомск', '1.2.16'),
            (r'нововаршавск', '1.2.17'),
            (r'одесск', '1.2.18'),
            (r'оконешниковск', '1.2.19'),
            (r'омск', '1.2.20'),
            (r'павлоградск', '1.2.21'),
            (r'полтавск', '1.2.22'),
            (r'русско[- ]полянск', '1.2.23'),
            (r'саргатск', '1.2.24'),
            (r'седельниковск', '1.2.25'),
            (r'таврическ', '1.2.26'),
            (r'тарск', '1.2.27'),
            (r'тевризск', '1.2.28'),
            (r'тюкалинск', '1.2.29'),
            (r'усть[- ]ишимск', '1.2.30'),
            (r'черлакск', '1.2.31'),
            (r'шербакульск', '1.2.32'),
        )),
        (r'город|омск\b', '1.1', (
            (r'центр', '1.1.1'),
            (r'киров', '1.1.2'),
            (r'октябрь', '1.1.3'),
            (r'ленин', '1.1.4'),
            (r'совет', '1.1.5'),
        )),
    )),
    #(r'социального пособия|назначение пособия|на погребение лицу|обязанность осуществить погребение|социальное пособие на погребение|пособие на погребение|погребение', '2'),
    (r'дополнительные услуги|платные услуги|перечень платных услуг|услуг в мфц|платные услуги в мфц|платные услуги|дополнительные платные услуги', '3'),
    (r'(регистрация|внесение) изменений|выдача документа|в системе учета|в системе индивидуального учета|снилс', '4'),
    (r'постановка на учет|прием заявления|о постановке на учет|на учет в налоговом органе|повторная выдача|свидетельство о постановке|инн|идентификационной номер|свидетельство инн', '5'),
    (r'выдача справок|справка о судимости|об отсутствии судимости|справка о судимости|справка об отсутствии судимости', '6'),
    (r'транспортная карта|этк|выдача карт|продление электронных транспортных карт|проживающим на территории омской области|выдача электронных транспортных карт|этк|транспортная карта', '7', (
        (r'оформить|новая', '7.1'),
        (r'продлить', '7.2'),
        (r'дубликат', '7.3'),
    )),
    (r'госсоцпомощь|гсп|социальная помощь|соцпомощь|назначение социальной помощи|на основании социального контракта', '8'),
    (r'^\bрегистрация\b$|подтверждение личности|удаление аккаунта|удаление аккаунта на едином портале|аккаунт на епгу|портале госуслуг|учетная запись на портале госуслуг|завести|подтвердить|восстановить|удалить (учетную запись|аккаунт) но госуслугах', '9'),
    # (r'регистрация|подтверждение личности|удаление аккаунта|удаление аккаунта на едином портале|аккаунт на епгу|портале госуслуг|учетная запись на портале госуслуг|завести|подтвердить|восстановить|удалить (учетную запись|аккаунт) но госуслугах', '9'),
    (r'на регистрационный учет|регистрационный учет граждан|учет граждан российской федерации|учет по месту пребывания|по месту жительства|в пределах рф|в переделах российской федерации|приема и выдачи документов о регистрации|прописка|регучет|регистрационный учет|постановка на учет|снятие с учета', '10', (
        (r"^постоянн\w* \w*регистр\w*|\w*регистр\w* постоянн\w*", "10.1"),
        # (r'\bпоста(но)?в.+постоян', '10.1'),
        (r"^временн\w* \w*регистр\w*|\w*регистр\w* временн\w*", "10.2"),
        # (r'\bпоста(но)?в.+времен', '10.2'),
        (r'\bснят.+постоян', '10.3'),
        (r'\bснят.+времен', '10.4'),
    )),
    (r'миграц\w+ уч[её]т|иностранн\w+ граждан|лиц\w* без гражданства|мигучет', '11', (
        (r'\bпоста(но)?в', '11.1'),
        (r'\bснят', '11.2'),
        (r'регистрац', '11.3'),
    )),
    (r"проведение экзаменов|на право управления|управления транспортными средствами|выдача водительских удостоверений|российских национальных|национальных водительских удостоверений|международных водительских удостоверений|^\bводительское удостоверение\b|^\bправа\b|водительские права|замена прав|замена водительского удостоверения", "12", (
    # (r'проведение экзаменов|на право управления|управления транспортными средствами|выдача водительских удостоверений|российских национальных|национальных водительских удостоверений|международных водительских удостоверений|водительское удостоверение|права|водительские права|замена прав', '12', (
        (r"\b(за|о)?конч\w+ срок\w действия|(\w*кон|просроч|истек\w*)\w* ?(срок\w*|прав\w*)?", "12.1"),
        # (r'\b(за|о)?конч\w+ срок\w действия', '12.1'),
        (r"(заключ|растор|разорвал|разрыв)\w* брак\w*|поменя\w+|измен\w*|друг\w* (фамил\w*|им\w*|отчеств\w*|данн\w*|пасп\w*)", "12.2"),
        # (r'(заключ|расторг)\w* брак|поменя\w+ (фамилию|имя|отчество|паспортн\w+ данны\w+)', '12.2'),
        (r"\w*теря\w*|укра\w*", "12.3"),
        # (r'(по|у)терял|\bукра[лд]', '12.3'),
    )),
    (r'подвергнутым административному наказанию|административному наказанию|потребление наркотических средств|психотропных веществ|без назначения врача|новых потенциально опасных|психоактивных веществ|справка о наркотиках', '13'),
    (r'выписка егрн|егрн|сведения из егрн|выписка из единого реестра недвижимости|сведения о недвижимости', '14'),
    (r"многодетн\w* сем\w*|(\w*регистр\w*|оформ\*|запис\w*) многодетн\w* сем\w*", "15"),
    # (r'многодетная семья|регистрация многодетной|многодетной семьи', '15'),
    (r"(выд\w*|оформ\w*|получ\w*)? ?(справ\w*|дубликат\w* справ\w*|дубликат\w* удостов\w*) (многод\w*|многод\w* сем\w*)", "16", (
    # (r'выдача справок|дубликатов удостоверения|дубликат удостоверения многодетной семьи|потеряли удостоверение многодетной семьи|сменить реквизиты карты|поменять реквизиты|смена адреса|сменить персональные данные в личном деле', '16', (
        (r"смен\w* адрес\w*|смен\w* адрес\w* регистр\w*|смен\w* персон\w* данн\w* ?(в личном деле)?|переезд льготника", "16.1"),
        # (r'смена адреса регистрации|переезд льготника', '16.1'),
        (r"\w*мен\w* (банковских)? ?реквиз\w*", "16.2"),
        # (r'смена банковских реквизитов', '16.2'),
        (r"(\w*теряли|пропал\w*) удостов\w* многодет\w* сем\w*|(получ\w*|оформ\w*) дубл\w* удостов\w* многодет\w* сем\w*", "16.3"),
        # (r'получение дубликата удостоверения многодетной семьи', '16.3'),
    )),
    (r'мер социальной поддержки|оплате жилого помещения|льгота жку|оплата жку|льгота на коммунальные услуги|льгота на оплату жкх|льгота на оплату квартиры|возврат по коммунальным платежам|вернуть деньги за коммунальные платежи', '17'),
    (r'сведений о трудовой деятельности|индивидуальном лицевом счете|справка о стаже|сведения о трудовом стаже|получить информацию из электронной трудовой книжки', '18'),
    (r'справка о размере пенсии|размер пенсии', '19'),
    (r'индивидуальный лицевой счет|состояние индивидуального лицевого счета', '20'),
    (r'удостоверение сироты вов|сирота войны|родители погибли в период вов|не исполнилось 18 лет в период вов', '21'),
    # ##################################################################
    # Исправление в структуре regexp (22 на верх, 23 на верх, 24.1 => 24)
    (r'ежемесячных выплат|ежемесячных денежных выплат|выплат отдельным категориям граждан|едв ветеранам|ежемесячная денежная выплата ветеранам|пособие 550 рублей', '22'),
    (r'технич\w* средств\w* реабилит\w*|тср|ветеранов протезами|протезно[- ]ортопедическими изделиями|выплата компенсаций за самостоятельно приобретенные|компенсация расходов на содержание|ветеринарное обслуживание|собак[- ]проводников', '23'),
    (r"регистрация юридических лиц|регистрация физических лиц|в качестве индивидуальных предпринимателей|крестьянских хозяйств|фермерских хозяйств", "24", (
        (r"открытие (ип|индив\w* предпр\w*)", "24.1"),
        (r"закрытие (ип|индив\w* предпр\w*)", "24.2"),
        (r"внесение изменений (ип|индив\w* предпр\w*)", "24.3"),
        (r"регистрация (юл|юрид\w* лиц\w*)", "24.4"),
        (r"ликвидация (юл|юрид\w* лиц\w*)", "24.5"),
        (r"увеличение уставного капитала (юл|юрид\w* лиц\w*)", "24.6"),
        (r"изменение состава учредителей (юл|юрид\w* лиц\w*)", "24.7"),
        (r"подача уведомления о реорганизации (юл|юрид\w* лиц\w*)", "24.8"),
        (r"(измен\w* наименов\w*|адрес\w* мест\w* нахожд\w*|сведений о филиалах и представительствах) (юл|юрид\w* лиц\w*)", "24.9"),
        (r"(назнач\w* нов\w* руковод\w*|измен\w* должн\w* руковод\w*|назнач\w* нов\w* руковод\w* или измен\w* должн\w* руковод\w*|) (юл|юрид\w* лиц\w*)", "24.10"),
        (r"\w*мен\w* \w*вид\w* эконом\w* деятельн\w* (юл|юрид\w* лиц\w*)", "24.11"),
    )),
    # ##################################################################
    (r'выплаты отдельным категориям граждан|ежемесячная выплата инвалидам|ежемесячная выплата ветеранам боевых действий', '25'),
    (r'дополнительной меры социальной поддержки|денежного эквивалента расходов|уплату взноса на капитальный ремонт|ремонт общего имущества|капитальный ремонт пожилым|льгота по капремонту|оплата капитального ремонта', '26'),
    (r"ден\w* выплат\w* воен\w*|(компенс\w*)? ?воен\w* травм\w*|пособие (на)? ?ребенка (воен\w*|военнослуж\w*)|\w*плат\w* (на)? ?ремонт\w* дом\w* ?(военнослуж\w*)?|компенсации военнослужащим|компенсации членам их семей|компенсация вдове военнослужащего|475 приказ|(возврат|компенс\w*) за (детск\w*)? ?(лагер\w*) ?(для)? ?(ребенка)? ?(военнослужащего)?", "27", (
        # (r'компенсации военнослужащим|компенсации членам их семей|компенсация вдове военнослужащего|475 приказ|возврат за лагерь для ребенка военнослужащего', '27', (
        (r'компенсация коммунальных платежей|475 приказ|компенсация вдове военнослужащего', '27.1'),
        (r'единовременная выплата на ремонт дома', '27.2'),
        (r'ежегодная выплата на летний оздоровительный отдых ребенка', '27.3'),
        (r'ежемесячное пособие на ребенка военнослужащего', '27.4'),
        (r'ежемесячная компенсация инвалидам по военной травме', '27.5'),
        # (r'(один)? ?миллион за участника сво|(один)? ?миллион членам погибшего участника сво', '33'),
    )),
    (r'предоставление единовременной денежной выплаты|выплаты участникам сво|выплаты участникам специальной военной операции|выплата губернатора как участнику сво|выплата участнику сво|единовременная выплата участнику сво', '28'),
    (r'управляемом инвалидом|перевозящем инвалида|федеральный реестр инвалидов|парковка для инвалида|знак инвалида', '29'),
    (r"(загран)?паспорт старого образца|(загран)?паспорт на 5 лет", "30", (
    # (r'оформление паспортов|выдача паспортов|паспартов гражданина рф|за пределами территории рф|за пределами российской федерации|загран паспорт на 5 лет|загран паспорт старого образца', '30', (
        (r'совершеннолетн', '30.1'),
        (r'\bреб[её]но?к\w?', '30.2', (
            (r'заграничный паспорт необходим для граждан в возрасте от 14 до 18 лет или (недееспособному|ограниченно дееспособному)', '30.2.1'),
            (r'заграничный паспорт необходим для граждан в возрасте до 14 лет', '30.2.2'),
        )),
    )),
    (r'3[- ]ндфл|прием от налогоплательщиков|налоговых деклараций|по налогу на доходы|доходы физических лиц', '31'),
    (r'предпенсионного возраста|об отнесении к категории|предпенсионный возраст', '32'),
    (r"(один)? ?миллион за участника сво|(один)? ?миллион членам погибшего участника сво|(один)? ?миллион за погибшего участника сво", "33"),
    # (r'(один)? ?миллион за участника сво|(один)? ?миллион членам погибшего участника сво', '33'),
    (r'членам семей погибших|членам семей умерших|в войсках национальной гвардии|миллион за участника сво|миллион членам погибшего участника сво', '33'),
    (r'пятерых и более|пятерых детей|ежемесячного пособия семьям', '34'),
    (r"добровольному переселению|проживающих за рубежом|прибывшим в омскую область|соотечественники|подъемное пособие соотечественникам|компенсация по договору найма соотечественникам|единовременная выплата соотечественникам", "35", (
        (r"пособ\w*|подъем\w*|единовр\w* пособ\w*|единовр\w* подъемн\w* пособ\w*|пособ\w* соотеч\w*|единовр\w* пособ\w* соотеч\w*", "35.1"),
        (r"компен\w* за найм|компен\w* найма|компен\w* по договору найма|компен\w* договор\w* найма\w*|компен\w* за жилое помещение|компен\w* жил\w* помещ\w*|компен\w* ?(програм\w*|по програм\w*)? ?(добров\w*)? ?(перес\w*)?", "35.2"),
        (r"(единовр\w*)? ?(денежн\w*)? ?выплат\w* ?(по трудоустр\w?|трудоустр\w*)?", "35.3"),
    )),
    (r'предоставление инвалидам|детям инвалидам|имеющим транспортные средства|обязательного страхования гражданской ответственности|их законным представителям|компенсация осаго|возврат осаго', '36'),
    (r'при передаче ребенка|ребенка на воспитание|на воспитание в семью|пособие при опеке|пособие при усыновлении', '37'),
    (r'путевок на санаторно[- ]курортное лечение|путевок на лечение|профилактики основных заболеваний|бесплатного проезда|на междугороднем транспорте|к месту лечения и обратно|санаторно[- ]курортное лечение|санкур', '38'),
    (r'награжденный нагрудным знаком|донор|доноры|почетный донор', '39'),
    (r'доступ к личному кабинету|кабинету налогоплательщика|личный кабинет на сайте фнс|личный кабинет на сайте налоговой', '40'),
    (r'при рождении двоих детей|двоих детей|двоих и более детей', '41'),
    (r'единое пособие|рождением ребенка|воспитанием ребенка', '42'),
    (r'едв многодетной|выплата многодетной семье', '43'),
    (r'предоставление субсидий|на оплату жилого помещения|оплату коммунальных услуг|субсидия|субсидия на жку', '44'),
    (r"путинские|(выплат\w*)? ?(с)? ?(рожден\w*)? ?перв\w* реб[её]н\w*|усынов\w* перв\w* реб[её]н\w*|выпл\w* (на|для)? ?перв\w* реб[её]н\w*", "45"),
    # (r'(выплат\w*)? ?(с)? ?(рожден\w*)? ?перв\w* реб[её]н\w*|усынов\w* перв\w* реб[её]н\w*|выпл\w* (на|для)? ?перв\w* реб[её]н\w*', '45'),
    # (r'с рождением первого ребенка|усыновлением первого ребенка|выплата (на|для) первого ребенка', '45'),
    (r"выплата на третьего|(едеве|едеве|едевэ|е де ве|е де вэ|едв|едэвэ|едэве|е дэ вэ|е дэ ве|ежемес\w* денеж\w* выпл\w*) на третьего ?(реб[её]н\w*)?", "46"),
    # (r'(едеве|едеве|едевэ|е де ве|е де вэ|едв|едэвэ|едэве|е дэ вэ|е дэ ве|ежемес\w* денеж\w* выпл\w*) на третьего ?(реб[её]н\w*)?', '46'),
    (r'рождение третьего ребенка|с рождением третьего|или последующих детей|(едеве|едеве|едевэ|е де ве|е де вэ|едв|едэвэ|едэве|е дэ вэ|е дэ ве|ежемес\w* денеж\w* выпл\w*) на третьего', '46'),
    (r'(выплат\w*)? ?(с)? ?(рожден\w*)? ?трет\w* реб[её]н\w*|усынов\w* трет\w* реб[её]н\w*|выпл\w* (на|для)? ?трет\w* реб[её]н\w*', '46'),
    # (r'рождение третьего ребенка|с рождением третьего|или последующих детей|едв на третьего', '46'),
    # Точно по ключевым словам Омска
    (r"(загран)?паспорт нового образца|(загран)?паспорт на 10 лет", "47"),
    # (r'содержащих электронные носители информации|за пределами территории российской федерации|загран|паспорт нового образца|загран|паспорт на 10 лет', '47'),
    (r'выдача сертификата|материнский капитал|семейный капитал|областной материнский', '48'),
    (r'выплата к дню победы|едв на день победы|выплата к 9 мая', '49'),
    (r'перерасчет пенсии|замещавшим государственные должности|должности государственной гражданской службы|замещавшим на постоянной основе|в органах государственной власти|выплата к пенсии гос|служащему', '50'),
    (r'единовременное пособие при рождении ребенка|уволенным в период беременности|уволенным в период отпуска', '51'),
    (r'ежемесячное пособие по уходу за ребенком', '52'),
    (r'компенсация на догазификацию|догазификация|догазификация домовладений|расходов на догазификацию', '53'),
    (r'\bе ?м ?о|назначение е ?м ?о|ежемесячное материальное обеспечение', '54'),
    (r'выдача удостоверения|погибшего инвалида войны|умершего инвалида войны|участника вов|участника великой отечественной войны', '55'),
    (r'(выдача|получ\w*)? ?удостов\w* (участн\w* (великой отечественной войны|вов|вбд)|вдовы (инвалида)? ?(великой отечественной войны|вов|вбд))', '55'),
    (r'(выдача|получ\w*)? ?удостов\w* (участн\w*|член\w* сем\w* (ветер\w* боевых действий|вбд))', '55'),
    # (r'выдача удостоверения|погибшего инвалида войны|умершего инвалида войны|участника вов|участника великой отечественной войны', '55'),
    (r'выплат\w* мобилиз\w*|(в связи|c|по) мобилиз\w*|призв\w* ?(на военную службу)?|призв\w* по мобилиз\w*', '56'),
    # (r'выплата по мобилизации|призванным на военную службу|призванным по мобилизации', '56'),
    (r'предоставление компенсации|отопления и освещения|оплату жилых помещений|компенсация педагогическим работникам|жку педагогам|возврат жку учителям|компенсация жку учителям', '57'),
    (r"(заключ\w*|зарег\w*|оформ\w*|регистр\w*) брак\w*|государственная регистрация брака", "58"),
    # (r'заключение брака|регистрация брака|государственная регистрация брака', '58'),
    (r'расторжение брака|по взаимному согласию супругов|не имеющих общих детей|не достигших совершеннолетия|государственная регистрация расторжения брака', '59'),
    (r'банкротство|признание гражданина банкротом|банкротом во внесудебном порядке', '60'),
    (r'очная идентификация граждан|получения электронной подписи|в приложении госключ|госключ|электронная подпись', '61'),
    (r'полис омс|полис согаз|полис обязательного медицинского страхования', '62'),
    (r'апостиль|предоставление апостиля|на российских официальных документах|подлежащих вывозу за пределы', '63'),
    (r"(оформл\w*|получ\w*) карт\w* болельщ\w*|кэ бэ|ка бэ|карта болельщика|\bк ?б\b", "64"),
    # (r'оформления карты болельщика|карта болельщика|\bк ?б\b', '64'),
    (r'выдача охотничьего билета|аннулирование охотничьего билета|единого федерального образца|охотничий билет', '65'),
    (r"присв\w* адрес\w* ?(дом\w*|объек\w*|зу|земельн\*|участк\w*)?", "66"),
    # (r"присвоение адреса дому|(присв\w*|аннулир\w*|анулир\w*|) адреc\w* ?(объек\w*|дом\w*|зу)?", "66"),
    # (r'присвоение адресов|аннулирование адресов|адресов объектам адресации|присв\w* адрес\w* (дом\w*|зу)', '66'),
    (r'невозможности государственной регистрации|регистрации перехода|прекращения|ограничения права|обременения объекта недвижимости|без личного участия собственника|запрет на сделку|запрет регистрационных действий без личного участия', '67'),
    # NOTE: 68 (68.1 - 68.5) is reserved for Passport (Passport, 14, 20|45, сhange, bad, lost) (added as separate lists)
    (r"(присв\w*|назнач\w*|награжд\w*|получ\w*)? ?(зван\w*|статус\w*|удостов\w*|документ\w*)? ?ветеран\w* труд\w*", "69"),
    (r"(присв\w*|назнач\w*|награжд\w*|получ\w*)? ?(зван\w*|статус\w*|удостов\w*|документ\w*)? ?ветеран\w* омской области", "70"),

]

QUESTIONS_PASSPORT_RUSSIAN_FEDERATION = [
    (r"(рф|росс\w*)? ?паспорт ?(рф|росс\w*)?|паспорт (получ\w*|оформ\w*|\w*делать|\w*мен\w*|выда\w*|нуж\w*|надо|заказ\w*)|(получ\w*|оформ\w*|\w*делать|\w*мен\w*|выда\w*|нуж\w*|надо|заказ\w*) пасп[оа]рт\w* ?(российский|российской федерации|рф|россии)?", "68", (
    # (r"пасп[оа]рт\w* (получ\w*|оформ\w*|\w*делать|\w*мен\w*|выда\w*|нуж\w*|надо|заказ\w*)|(получ\w*|оформ\w*|\w*делать|\w*мен\w*|выда\w*|нуж\w*|надо|заказ\w*) пасп[оа]рт\w* ?(российский|российской федерации|рф|россии)?", "68", (
        (r"14( лет)?|(возраст|достижение|в возрасте|в|уже|по достижению|) 14( лет)?", "68.1"),
        (r"20( лет)?|(возраст|достижение|в возрасте|в|уже|по достижению|) 20( лет)?", "68.2"),
        (r"45( лет)?|(возраст|достижение|в возрасте|в|уже|по достижению|) 45( лет)?", "68.2"),
        (r"(смен\w*|измен\w*|друг\w*|в связи с изменен\w*) (фамил\w*|им\w*|отчеств\w*|данн\w*|паспортных данн\w*) ?(пасп[оа]рт\w*|в пасп[оа]рт\w*)?", "68.3"),
        (r"(пасп[оа]рт)? ?(\w*мочил|испор\w*|порв\w*|разорв\w*|порча) ?(пасп[оа]рт\w*)?", "68.4"),
        (r"(пасп[оа]рт)? ?(\w*терян\w*|проебал|\w*воровал\w*|исчез\w*|проп\w*) ?(пасп[оа]рт\w*)?", "68.5"),
    )),
]

QUESTIONS_PASSPORT_14_YEARS = [
    (r"(возраст|достижение|в возрасте|в|уже|по достижению|) 14( лет)?", "68.1"),
    (r"(как|как можно|как мне)? ?пасп[оа]рт (получить|оформить|сделать)? ?(возраст 14( лет)?|в возрасте 14( лет)?|в 14( лет)?|по достижению 14( лет)?|14( лет)?)", "68.1"),
    (r"(как|как можно|как мне)? ?(получить|оформить|сделать)? ?пасп[оа]рт (возраст 14( лет)?|в возрасте 14( лет)?|в 14( лет)?|по достижению 14( лет)?|14( лет)?)", "68.1"),
]

QUESTIONS_PASSPORT_20_YEARS = [
    (r"пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 20( лет)?|в возрасте 20( лет)?|в 20( лет)?|по достижению 20( лет)?|20( лет)?)", "68.2"),
    (r"(как|как можно|как мне)? ?пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 20( лет)?|в возрасте 20( лет)?|в 20( лет)?|по достижению 20( лет)?|20( лет)?)", "68.2"),
    (r"(как|как можно|как мне)? ?(получить|оформить|сделать|поменять)? ?пасп[оа]рт (возраст 20( лет)?|в возрасте 20( лет)?|в 20( лет)?|по достижению 20( лет)?|20( лет)?)", "68.2"),
]

QUESTIONS_PASSPORT_45_YEARS = [
    (r"пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 45( лет)?|в возрасте 45( лет)?|в 45( лет)?|по достижению 45( лет)?|45( лет)?)", "68.2"),
    (r"(как|как можно|как мне)? ?пасп[оа]рт (получить|оформить|сделать|поменять)? ?(возраст 45( лет)?|в возрасте 45( лет)?|в 45( лет)?|по достижению 45( лет)?|45( лет)?)", "68.2"),
    (r"(как|как можно|как мне)? ?(получить|оформить|сделать|поменять)? ?(новый)? ?пасп[оа]рт (возраст 45( лет)?|в возрасте 45( лет)?|в 45( лет)?|по достижению 45( лет)?|45( лет)?)", "68.2"),
]

QUESTIONS_PASSPORT_BAD = [
    (r"(\w*мочил|испор\w*|порв\w*|разорв\w*) пасп[оа]рт ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "68.4"),
    (r"пасп[оа]рт (\w*мочил|испор\w*|порв\w*|разорв\w*) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "68.4"),
    (r"(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(плохой|испорченный|ху[её]вый|\w*ванный|\w*моченный) пасп[оа]рт", "68.4"),
    (r"(плохой|испорченный|ху[её]вый|\w*ванный|\w*моченный) пасп[оа]рт (как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "68.4"),
]

QUESTIONS_PASSPORT_LOST = [
    (r"(потерял|утерял|проебал|уворовали|исчез|потерянный|утерянный) пасп[оа]рт ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "68.5"),
    (r"пасп[оа]рт (потерял|утерял|проебал|уворовали|исчез|потерянный|утерянный) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "68.5"),
    (r"(как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(плохой|испорченный|хуевый|порванный|намоченный) пасп[оа]рт", "68.5"),
    (r"(потерянный|утерянный|про[её]банный|исчезнувший) пасп[оа]рт (как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "68.5"),
]

QUESTIONS_PASSPORT_CHANGE_DATA = [
    (r"(смен\w*|измен\w*|друг\w*|в связи с изменен\w*) (фамили\w*|им\w*|отчеств\w*|данн\w*) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "68.3"),
    (r"(измен\w*|друг\w*|в связи с изменен\w*) (фамили\w*|им\w*|отчеств\w*|данн\w*) ?(как|ка1к можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "68.3"),
    (r"(фамили\w*|им\w*|отчеств\w*|данн\w*) (измен\w*|друг\w*|в связи с изменен\w*) (пасп[оа]рт|в пасп[оа]рте) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)?", "68.3"),
    (r"(фамили\w*|им\w*|отчеств\w*|данн\w*) (измен\w*|друг\w*|в связи с изменен\w*) ?(как|как можно|как мне)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте)", "68.3"),
    (r"(как|как можно)? ?(заменить|сделать|получить|заказать|оформить)? ?(новый)? ?(пасп[оа]рт|в пасп[оа]рте) (измен\w*|друг\w*|в связи с изменен\w*) (фамили\w*|им\w*|отчеств\w*|данн\w*)", "68.3"),
]

QUESTIONS.extend(QUESTIONS_PASSPORT_RUSSIAN_FEDERATION)
QUESTIONS.extend(QUESTIONS_PASSPORT_14_YEARS)
QUESTIONS.extend(QUESTIONS_PASSPORT_20_YEARS)
QUESTIONS.extend(QUESTIONS_PASSPORT_45_YEARS)
QUESTIONS.extend(QUESTIONS_PASSPORT_BAD)
QUESTIONS.extend(QUESTIONS_PASSPORT_LOST)
QUESTIONS.extend(QUESTIONS_PASSPORT_CHANGE_DATA)


test_phrases = [
    # "Миллион за участника СВО",  # 33
    # "миллион членам погибшего участника СВО",  # 33
    # "Предоставление единовременной  выплаты членам семей погибших военнослужащих",  # 33, 35.3
    # "Предоставление дополнительной меры поддержки в виде денежной выплаты членам семей погибших военнослужащих"  # 33, 35.3
    # "Выплата за погибшего ветерана СВО",  # 35.3
    # "Выплата за смерть участника СВО",  # 35.3
    # "миллион за погибшего участника СВО",  # 33
    # "выплата за погибшего ветерана боевых действий"  # 35.3

]


test_phrases_additional = [
    # "паспорт получить",
]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
