from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r'ден\w* выплат\w* воен\w*|(компенс\w*)? ?воен\w* травм\w*|пособие (на)? ?ребенка (воен\w*|военнослуж\w*)|\w*плат\w* (на)? ?ремонт\w* дом\w* ?(военнослуж\w*)?|компенсации военнослужащим|компенсации членам их семей|компенсация вдове военнослужащего|475 приказ|(возврат|компенс\w*) за (детск\w*)? ?(лагер\w*) ?(для)? ?(ребенка)? ?(военнослужащего)?', '27', (
        # (r'компенсации военнослужащим|компенсации членам их семей|компенсация вдове военнослужащего|475 приказ|возврат за лагерь для ребенка военнослужащего', '27', (
        (r'компенсация коммунальных платежей|475 приказ|компенсация вдове военнослужащего', '27.1'),
        (r'единовременная выплата на ремонт дома', '27.2'),
        (r'ежегодная выплата на летний оздоровительный отдых ребенка', '27.3'),
        (r'ежемесячное пособие на ребенка военнослужащего', '27.4'),
        (r'ежемесячная компенсация инвалидам по военной травме', '27.5'),
        (r'(один)? ?миллион за участника сво|(один)? ?миллион членам погибшего участника сво', '28'),
    )),
]

test_phrases = [
    # "компенсация вдове военнослужащего",
    # "475 приказ",
    # "возврат за лагерь ребенка военнослужащего",
    # "выплата на ремонт дома военнослужащего",
    # "выплата на ремонт дома",
    # "компенсация за детский лагерь",
    "пособие на ребенка военного",
    "пособие на ребенка военнослужащего",
    "военная травма",
    "компенсация по военной травме",
    "денежные выплаты военным",
]


test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
