from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r'^\bрегистрация\b$|подтверждение личности|удаление аккаунта|удаление аккаунта на едином портале|аккаунт на епгу|портале госуслуг|учетная запись на портале госуслуг|завести|подтвердить|восстановить|удалить (учетную запись|аккаунт) но госуслугах', '9'),
    # (r'регистрация|подтверждение личности|удаление аккаунта|удаление аккаунта на едином портале|аккаунт на епгу|портале госуслуг|учетная запись на портале госуслуг|завести|подтвердить|восстановить|удалить (учетную запись|аккаунт) но госуслугах', '9'),
    (r'на регистрационный учет|регистрационный учет граждан|учет граждан российской федерации|учет по месту пребывания|по месту жительства|в пределах рф|в переделах российской федерации|приема и выдачи документов о регистрации|прописка|регучет|регистрационный учет|постановка на учет|снятие с учета', '10', (
        (r"^постоянн\w* \w*регистр\w*|\w*регистр\w* постоянн\w*", "10.1"),
        # (r'\bпоста(но)?в.+постоян', '10.1'),
        (r"^временн\w* \w*регистр\w*|\w*регистр\w* временн\w*", "10.2"),
        # (r'\bпоста(но)?в.+времен', '10.2'),
        (r'\bснят.+постоян', '10.3'),
        (r'\bснят.+времен', '10.4'),
    )),
]

test_phrases = [
    "регистрация",
    "регистрационный учет",
    "постоянная регистрация",
    "регистрация постоянная",
    "регистрация временная",
    "временная регистрация",
    "снятие с временной регистрации",
    "снятие с постоянной регистрации",
    "на регистрационный учет"
]

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
