from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r"^\bмногодетн\w* сем\w*|(\w*регистр\w*|оформ\*|запис\w*) многодетн\w* сем\w*", "15"),
    # (r'многодетная семья|регистрация многодетной|многодетной семьи', '15'),
    (r"(выд\w*|оформ\w*|получ\w*)? ?(справ\w*|дубликат\w* справ\w*|дубликат\w* удостов\w*) (многод\w*|многод\w* сем\w*)", "16", (
    # (r'выдача справок|дубликатов удостоверения|дубликат удостоверения многодетной семьи|потеряли удостоверение многодетной семьи|сменить реквизиты карты|поменять реквизиты|смена адреса|сменить персональные данные в личном деле', '16', (
        (r"смен\w* адрес\w*|смен\w* адрес\w* регистр\w*|смен\w* персон\w* данн\w* ?(в личном деле)?|переезд льготника", "16.1"),
        # (r'смена адреса регистрации|переезд льготника', '16.1'),
        (r"\w*мен\w* (банковских)? ?реквиз\w*", "16.2"),
        # (r'смена банковских реквизитов', '16.2'),
        (r"(\w*теряли|пропал\w*) удостов\w* многодет\w* сем\w*|(получ\w*|оформ\w*) дубл\w* удостов\w* многодет\w* сем\w*", "16.3"),
        # (r'получение дубликата удостоверения многодетной семьи', '16.3'),
    )),
]

test_phrases = [
    "дубликат удостоверения многодетной семьи",
    "потеряли удостоверение многодетной семьи",
    "сменить реквизиты карты",
    "поменять реквизиты",
    "смена адреса",
    "сменить персональные данные в личном деле"
]

test_phrases_additional = [
    # "многодетная семья",
    # "многодетной семьи",
    # "многодетные семьи",
    # "многодетным семьям",
    # "многодетными семьями",
    # "многодетных семей",
    # "регистрация многодетной семьи",
    # "оформление многодетной семьи",
    # "запись многодетной семьи",
    # "регистрация многодетных семей",
    # "оформление многодетных семей",
    # "запись многодетных семей",
]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
