from utilities.regexp_check_with_query import check_regexp_with_queries


QUESTIONS = [
    (r'ежемесячных выплат|ежемесячных денежных выплат|выплат отдельным категориям граждан|едв ветеранам|ежемесячная денежная выплата ветеранам|пособие 550 рублей', '22'),
    (r'технич\w* средств\w* реабилит\w*|тср|ветеранов протезами|протезно[- ]ортопедическими изделиями|выплата компенсаций за самостоятельно приобретенные|компенсация расходов на содержание|ветеринарное обслуживание|собак[- ]проводников', '23'),
    (r'регистрация юридических лиц|регистрация физических лиц|в качестве индивидуальных предпринимателей|крестьянских хозяйств|фермерских хозяйств', '24', (
        (r'открытие ип', '24.1'),
        (r'закрытие ип', '24.2'),
        (r'внесение изменений ип', '24.3'),
        (r'регистрация юл', '24.4'),
        (r'ликвидация юл', '24.5'),
        (r'увеличение уставного капитала юл', '24.6'),
        (r'изменение состава учредителей юл', '24.7'),
        (r'подача уведомления о реорганизации юл', '24.8'),
        (r'изменение наименования|адреса места нахождения юл сведений о филиалах и представительствах', '24.9'),
        (r'назначение нового руководителя юл или изменение должности руководителя', '24.10'),
        (r'изменение видов экономической деятельности юл', '24.11'),
    )),
]


test_phrases = [
    "технические средства реабилитации",
]

test_phrases_additional = [

]

test_phrases.extend(test_phrases_additional)

check_regexp_with_queries(regular_expressions=QUESTIONS,
                          queries=test_phrases)
